---
kind: property
id: P:Autodesk.Revit.UI.ComboBoxData.Image
source: html/2cd2e4cb-7f83-d5a8-577a-e8ed209c80c6.htm
---
# Autodesk.Revit.UI.ComboBoxData.Image Property

The image shown on the ComboBox.

## Syntax (C#)
```csharp
public ImageSource Image { get; set; }
```

## Remarks
The image will be shown on the left side of the item.
The best size is 16 x 16 pixels.